---
kind: other
id: Methods.T:Autodesk.Revit.DB.FilterNumericValueRule
source: html/7e2c5f32-97da-0268-367c-129f9124c2aa.htm
---
# FilterNumericValueRule Methods

Derived classes override this method to implement the test that determines
 whether the given element passes this rule or not.